IDENTIFICATION DIVISION.
PROGRAM-ID. EVENT-REPLAY.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 EVENT-LINE PIC X(200).

PROCEDURE DIVISION.

OPEN INPUT EVENT-FILE.

PERFORM UNTIL EOF

 READ EVENT-FILE INTO EVENT-LINE
 DISPLAY "Processing Event: " EVENT-LINE

END-PERFORM.

STOP RUN.