IDENTIFICATION DIVISION.
PROGRAM-ID. LEDGER.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 EVENT-TYPE PIC X(30).
01 USER-ID PIC X(36).

PROCEDURE DIVISION.

DISPLAY "Enter Event Type:".
ACCEPT EVENT-TYPE.
DISPLAY "Enter User ID:".
ACCEPT USER-ID.

DISPLAY "Ledger Event Recorded: " EVENT-TYPE " for User " USER-ID.
STOP RUN.
