       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEDGER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FIRST  PIC 9(10) VALUE 0.
       01 WS-SECOND PIC 9(10) VALUE 0.
       01 WS-RESULT PIC 9(10) VALUE 0.

       01 CMD-LINE-ARGS.
          05 ARG1 PIC X(10).
          05 ARG2 PIC X(10).

       PROCEDURE DIVISION.
           ACCEPT CMD-LINE-ARGS FROM COMMAND-LINE.

           MOVE FUNCTION NUMVAL(ARG1) TO WS-FIRST
           MOVE FUNCTION NUMVAL(ARG2) TO WS-SECOND

           COMPUTE WS-RESULT = WS-FIRST + WS-SECOND

           DISPLAY WS-RESULT

           GOBACK.
